InformationRegisters/АкцептованиеОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АкцептованиеОпераций</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Акцептант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеКредитногоИнструмента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.Распоряжение</v8:Type>
						<v8:Type>cfg:DocumentRef.СтрокаБанковскойВыписки</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
						<v8:Type>cfg:DocumentRef.Оплата</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаСВалютой</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаПереводДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАкцепта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАкцептов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ГруппыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ГруппыПользователей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НазначенныеРоли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеВидыДоговоровИСчетаДоверительногоУправления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/РаботаСБизнесПроцессамиИЗадачами/Ext/Module.bsl
// Проверяет количество невыполненных задач по исполнителю у текущего пользователя
//
Функция КоличествоНевыполненныхЗадачТекущегоПользователя() Экспорт
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", 		ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация"));
	Запрос.УстановитьПараметр("Исполнитель", 		РаботаСПользователями.ТекущийПользователь());		
	Запрос.УстановитьПараметр("КонецТекущегоДня", 	КонецДня(ТекущаяДатаСеанса()));
		
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗадачиПоИсполнителю.Ссылка) КАК КоличествоЗадач
		|ИЗ
		|	Задача.ЗадачаИсполнителя.ЗадачиПоИсполнителю(
		|			&Исполнитель,
		|			Организация = &Организация
		|				И Дата <= &КонецТекущегоДня) КАК ЗадачиПоИсполнителю
		|ГДЕ
		|	НЕ ЗадачиПоИсполнителю.Выполнена
		|	И НЕ ЗадачиПоИсполнителю.ПометкаУдаления
		|	И ЗадачиПоИсполнителю.ТочкаМаршрута <> ЗНАЧЕНИЕ(БизнесПроцесс.ОбучениеСотрудника.ТочкаМаршрута.ПройтиОбучение)
		|	И (ЗадачиПоИсполнителю.БизнесПроцесс <> НЕОПРЕДЕЛЕНО
		|			ИЛИ ЗадачиПоИсполнителю.СрокИсполнения <= &КонецТекущегоДня)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.КоличествоЗадач;
	
КонецФункции

// Проверяет, что дата задачи на согласования поручения находится между датой поручения и крайней датой его исполнения
//
//	Параметры:
//		- ПоручениеНаВыводАктивов - ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств или ДокументСсылка.ПоручениеНаДвижениеЦенныхБумаг - поручение
//		- ДатаЗадачи - Дата и время задачи на согласование
//
Функция ПроверитьДатуЗадачиНаСогласованиеОтносительноСрокаПорученияНаВыводАктивов(Задача, Отказ = Ложь) Экспорт
	
	Если ТипЗнч(Задача.БизнесПроцесс) = Тип("БизнесПроцессСсылка.СогласованиеПорученийНаВыводАктивов") Тогда
				
		РаботаСДокументами.ПроверитьДатуИсполненияПоручения(Задача, Отказ);
				
	КонецЕсли;
	
	Возврат Не Отказ;
		
КонецФункции

// Проверяет поручение на движение денежных средств или ценных бумаг 
// и, если требуется, стартует бизнес-процесс согласования этого поручения
//
//	Параметры:
//		- ДокументОбъект - ДокументОбъект.ПоручениеНаДвижениеДенежныхСредств, ДокументОбъект.ПоручениеНаДвижениеЦенныхБумаг - проверяемое поручение
//		- Отказ - Булево
//
Процедура ПроверитьИНачатьСогласованиеПорученияНаВыводАктивов(ДокументОбъект, Отказ) Экспорт
		
	Если Не РаботаСДокументами.ТребуетсяСогласованиеПорученияНаВыводАктивов(ДокументОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Нельзя отменять проведение документа, если на основании введен вывод денежных средств или ценных бумаг
	Если ДокументОбъект.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВыводДенежныхСредств.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ВыводДенежныхСредств КАК ВыводДенежныхСредств
			|ГДЕ
			|	ВыводДенежныхСредств.Организация = &Организация
			|	И ВыводДенежныхСредств.Основание = &Основание
			|	И ВыводДенежныхСредств.Проведен
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВыводЦенныхБумаг.Ссылка
			|ИЗ
			|	Документ.ВыводЦенныхБумаг КАК ВыводЦенныхБумаг
			|ГДЕ
			|	ВыводЦенныхБумаг.Организация = &Организация
			|	И ВыводЦенныхБумаг.Поручение = &Основание
			|	И ВыводЦенныхБумаг.Проведен";
		
		Запрос.УстановитьПараметр("Организация", 	ДокументОбъект.Организация);
		Запрос.УстановитьПараметр("Основание",		ДокументОбъект.Ссылка);

		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На основании поручения уже проведен документ " + СокрЛП(Выборка.Ссылка) + ". Поручение не может быть изменено", Выборка.Ссылка,,, Отказ);
			Возврат;			
		КонецЕсли;

	КонецЕсли;
	
	// У непроведенных и помеченных на удаление помечаем бизнес-процесс и задачи на удаление
	Если ДокументОбъект.ПометкаУдаления Или Не ДокументОбъект.Проведен Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		ОбъектыБизнесПроцесса = ПолучитьОбъектыБизнесПроцесса(ДокументОбъект.Ссылка, ДокументОбъект.Организация);
		
		Для Каждого ОбъектБП Из ОбъектыБизнесПроцесса Цикл
			
			Попытка
				ТекОбъект = ОбъектБП.Ссылка.ПолучитьОбъект();
				ТекОбъект.УстановитьПометкуУдаления(Истина);	
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось пометить на удаление объект " + СокрЛП(ОбъектБП.Ссылка) + ": " + ОписаниеОшибки(), ОбъектБП.Ссылка,,, Отказ);
				Возврат;
			КонецПопытки;
			
		КонецЦикла;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
		
	// Проверяем, акцептован ли документ или есть ли по нему задачи 	
	Если ДокументОбъект.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	АкцептованиеОперацийСрезПоследних.Регистратор КАК Регистратор
			|ИЗ
			|	РегистрСведений.АкцептованиеОпераций.СрезПоследних(
			|			&Период,
			|			Организация = &Организация
			|				И Операция = &Ссылка
			|				И ВидАкцепта = ЗНАЧЕНИЕ(Перечисление.ВидыАкцептов.ПоручениеНаВыводАктивов)) КАК АкцептованиеОперацийСрезПоследних
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СогласованиеПорученийНаВыводАктивов.Ссылка
			|ИЗ
			|	Задача.ЗадачаИсполнителя КАК СогласованиеПорученийНаВыводАктивов
			|ГДЕ
			|	СогласованиеПорученийНаВыводАктивов.Основание = &Ссылка
			|	И ТИПЗНАЧЕНИЯ(СогласованиеПорученийНаВыводАктивов.БизнесПроцесс) = ТИП(БизнесПроцесс.СогласованиеПорученийНаВыводАктивов)
			|	И НЕ СогласованиеПорученийНаВыводАктивов.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("Период",			ТекущаяДата());
		Запрос.УстановитьПараметр("Организация", 	ДокументОбъект.Организация);
		Запрос.УстановитьПараметр("Ссылка",			ДокументОбъект.Ссылка);
				                                    
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Возврат;
		КонецЕсли;
		
		// Значит, нет акцепта или задач. Стартуем бизнес-процесс			
		УстановитьПривилегированныйРежим(Истина);

		НовыйПроцесс = БизнесПроцессы.СогласованиеПорученийНаВыводАктивов.СоздатьБизнесПроцесс();
		НовыйПроцесс.Заполнить(ДокументОбъект.Ссылка);
		НовыйПроцесс.Записать();
		
		Если ДокументОбъект.ДополнительныеСвойства.Свойство("ТребуетсяПодтверждениеКлиентскогоОтдела") Тогда
			НовыйПроцесс.ДополнительныеСвойства.Вставить("ТребуетсяПодтверждениеКлиентскогоОтдела");
		КонецЕсли;
		
		НовыйПроцесс.Старт();
		
		УстановитьПривилегированныйРежим(Ложь);

	КонецЕсли; 
	
КонецПроцедуры

// Получает ссылку либо на выполненную задачу, либо на задачу по исполнителю согласования поручения по наименованию задачи. 
// Если задача не найдена, возвращает Неопределено
//
//	Параметры:
//		- ДокументСсылка - ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств, ДокументСсылка.ПоручениеНаДвижениеЦенныхБумаг
//		- ИмяДействия - Строка - наименование задачи
//
Функция ПолучитьЗадачуНаСогласованиеПорученияНаВыводАктивовПоДействию(Поручение, ТочкаМаршрута) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СогласованиеПорученийНаВыводАктивов.Ссылка КАК Задача
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК СогласованиеПорученийНаВыводАктивов
		|ГДЕ
		|	СогласованиеПорученийНаВыводАктивов.Организация = &Организация
		|	И ТИПЗНАЧЕНИЯ(СогласованиеПорученийНаВыводАктивов.БизнесПроцесс) = ТИП(БизнесПроцесс.СогласованиеПорученийНаВыводАктивов)
		|	И СогласованиеПорученийНаВыводАктивов.Основание = &Поручение
		|	И СогласованиеПорученийНаВыводАктивов.ТочкаМаршрута = &ТочкаМаршрута
		|	И НЕ СогласованиеПорученийНаВыводАктивов.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Организация", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Поручение, "Организация"));
	Запрос.УстановитьПараметр("Поручение", Поручение);
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Задача;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьОбъектБизнесПроцессаСогласованияПорученияНаВыводАктивовПоДействию(Поручение, ТочкаМаршрута) Экспорт
	
	ОбъектыБизнесПроцесса = ПолучитьОбъектыБизнесПроцесса(Поручение,, ТочкаМаршрута);

	Если ОбъектыБизнесПроцесса.Количество() = 1 Тогда
		Возврат ОбъектыБизнесПроцесса[0].Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
			
КонецФункции

// При списании задолженности по поручению завершает бизнес-процесс согласования поручения и связанные задачи
//	
//	Параметры:
//		- ДокументОбъект - объект документа СписаниеЗадолженностейПоПоручению
//		- Отказ - Булево
//
Процедура ОбработатьБизнесПроцессПорученияПриСписанииЗадолженности(ДокументОбъект, Отказ) Экспорт
	
	Если ДокументОбъект.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		ОбъектыБизнесПроцесса = ПолучитьОбъектыБизнесПроцесса(ДокументОбъект.Поручение, ДокументОбъект.Организация); 
				
		Для Каждого ОбъектБП Из ОбъектыБизнесПроцесса Цикл
			
			Если ТипЗнч(ОбъектБП.Ссылка) = Тип("БизнесПроцессСсылка.СогласованиеПорученийНаВыводАктивов") Тогда
				ЗавершитьОтменитьБизнесПроцесс(ОбъектБП.Ссылка, Отказ)
			ИначеЕсли ТипЗнч(ОбъектБП.Ссылка) = Тип("ДокументСсылка.Акцепт") Тогда
				
				ТекОбъект = ОбъектБП.Ссылка.ПолучитьОбъект();
				ТекОбъект.УстановитьПометкуУдаления(Истина);
							
				Попытка 				
					ТекОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Исключение
					ВызватьИсключение "Не удалось завершить " + СокрЛП(ОбъектБП.Ссылка) + ": " + ОписаниеОшибки();				
				КонецПопытки;
	
			Иначе
				
				ТекОбъект = ОбъектБП.Ссылка.ПолучитьОбъект();
				
				Если ТекОбъект.ТочкаМаршрута = БизнесПроцессы.СогласованиеПорученийНаВыводАктивов.ТочкиМаршрута.СогласованиеОтделомСопровожденияОпераций
					И Не ТекОбъект.Выполнена Тогда
					
					ТекОбъект.УстановитьПометкуУдаления(Истина);
																
					Попытка 				
						ТекОбъект.Записать();
					Исключение
						ВызватьИсключение "Не удалось завершить задачу [" + СокрЛП(ОбъектБП.Ссылка) + "]: " + ОписаниеОшибки();				
					КонецПопытки;
	
				КонецЕсли;
				
			КонецЕсли;
						
		КонецЦикла;
		
		УстановитьПривилегированныйРежим(Ложь);

	КонецЕсли;	
	
КонецПроцедуры

Процедура ЗавершитьОтменитьБизнесПроцесс(БизнесПроцесс, Отказ) Экспорт
	
	БизнесПроцессОбъект = БизнесПроцесс.ПолучитьОбъект();
	БизнесПроцессОбъект.Завершен 	= Истина;
	БизнесПроцессОбъект.Отменен 	= Истина;
	
	Попытка 				
		БизнесПроцессОбъект.Записать();
	Исключение
		ВызватьИсключение "Не удалось завершить бизнес процесс [" + СокрЛП(БизнесПроцесс) + "]: " + ОписаниеОшибки();				
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗавершитьБизнесПроцессИОтменитьПоручение(Организация, Поручение, Отказ) Экспорт
	
	ОбъектыБизнесПроцесса = ПолучитьОбъектыБизнесПроцесса(Поручение, Организация);
	
	УстановитьПривилегированныйРежим(Истина);

	Для Каждого ОбъектБП Из ОбъектыБизнесПроцесса Цикл
			
		Если ТипЗнч(ОбъектБП.Ссылка) = Тип("БизнесПроцессСсылка.СогласованиеПорученийНаВыводАктивов") Тогда
			ЗавершитьОтменитьБизнесПроцесс(ОбъектБП.Ссылка, Отказ)
			
		ИначеЕсли ТипЗнч(ОбъектБП.Ссылка) = Тип("ДокументСсылка.Акцепт") Тогда
				
			ТекОбъект = ОбъектБП.Ссылка.ПолучитьОбъект();
			ТекОбъект.УстановитьПометкуУдаления(Истина);
						
			Попытка 				
				ТекОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Исключение
				ВызватьИсключение "Не удалось завершить " + СокрЛП(ОбъектБП.Ссылка) + ": " + ОписаниеОшибки();				
			КонецПопытки;
			
		Иначе
			
			ТекОбъект = ОбъектБП.Ссылка.ПолучитьОбъект();
			
			Если ТекОбъект.Выполнена Тогда
				
				ТекОбъект.Выполнена = Ложь;
				ТекОбъект.ДатаВыполнения = Неопределено;
				
				Попытка 				
					ТекОбъект.Записать();
				Исключение
					ВызватьИсключение "Не удалось завершить " + СокрЛП(ОбъектБП.Ссылка) + ": " + ОписаниеОшибки();				
				КонецПопытки;
				
			КонецЕсли;
			
			ТекОбъект.УстановитьПометкуУдаления(Истина);
						
			Попытка 				
				ТекОбъект.Записать();
			Исключение
				ВызватьИсключение "Не удалось завершить " + СокрЛП(ОбъектБП.Ссылка) + ": " + ОписаниеОшибки();				
			КонецПопытки;

		КонецЕсли;			
					
	КонецЦикла;
	
	ПоручениеОбъект = Поручение.ПолучитьОбъект(); 
	ПоручениеОбъект.УстановитьПометкуУдаления(Истина);
	ПоручениеОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
	
Процедура ПередЗаписьюЗадачи(Объект) Экспорт
	
	ЗапомнитьТекущиеРеквизитыЗадачи(Объект);
	
КонецПроцедуры // ПередЗаписью

Процедура ЗапомнитьТекущиеРеквизитыЗадачи(Объект)
	
	ЭтоНовый = Объект.ЭтоНовый();
	
	Объект.ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый);

	Если ЭтоНовый Тогда
		Возврат;
	КонецЕсли;
	
	ЗнчРеквизитов = Новый Структура();
	
	ИсключаемыеПоля = Новый Массив();
	ИсключаемыеПоля.Добавить("Ссылка");
	ИсключаемыеПоля.Добавить("ВерсияДанных");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Задача.*
		|ИЗ
		|	Задача." + Объект.Метаданные().Имя + " КАК Задача
		|ГДЕ
		|	Задача.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);	
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Для каждого Колонка Из РезультатЗапроса.Колонки Цикл
			Если ИсключаемыеПоля.Найти(Колонка.Имя) = Неопределено Тогда
				ЗнчРеквизитов.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Объект.ДополнительныеСвойства.Вставить("ПредЗначенияРеквизитов", ЗнчРеквизитов);
	
КонецПроцедуры 

Функция ПолучитьОбъектыБизнесПроцесса(Поручение, Организация = Неопределено, ТочкаМаршрута = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СогласованиеПорученийНаВыводАктивов.Ссылка КАК Ссылка
		|ИЗ
		|	БизнесПроцесс.СогласованиеПорученийНаВыводАктивов КАК СогласованиеПорученийНаВыводАктивов
		|ГДЕ
		|	СогласованиеПорученийНаВыводАктивов.Организация = &Организация
		|	И СогласованиеПорученийНаВыводАктивов.Основание = &Основание
		|	И НЕ СогласованиеПорученийНаВыводАктивов.ПометкаУдаления
		|	И &ТочкаМаршрута В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(БизнесПроцесс.СогласованиеПорученийНаВыводАктивов.ТочкаМаршрута.Старт), ЗНАЧЕНИЕ(БизнесПроцесс.СогласованиеПорученийНаВыводАктивов.ТочкаМаршрута.Завершение))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СогласованиеПорученийНаВыводАктивов.Ссылка
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК СогласованиеПорученийНаВыводАктивов
		|ГДЕ
		|	СогласованиеПорученийНаВыводАктивов.Организация = &Организация
		|	И ТИПЗНАЧЕНИЯ(СогласованиеПорученийНаВыводАктивов.БизнесПроцесс) = ТИП(БизнесПроцесс.СогласованиеПорученийНаВыводАктивов)
		|	И СогласованиеПорученийНаВыводАктивов.Основание = &Основание
		|	И НЕ СогласованиеПорученийНаВыводАктивов.ПометкаУдаления
		|	И (&ТочкаМаршрута = НЕОПРЕДЕЛЕНО
		|			ИЛИ СогласованиеПорученийНаВыводАктивов.ТочкаМаршрута = &ТочкаМаршрута)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АкцептованиеОперацийСрезПоследних.Регистратор
		|ИЗ
		|	РегистрСведений.АкцептованиеОпераций.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И Операция = &Основание
		|				И ВидАкцепта = ЗНАЧЕНИЕ(Перечисление.ВидыАкцептов.ПоручениеНаВыводАктивов)) КАК АкцептованиеОперацийСрезПоследних
		|ГДЕ
		|	&ТочкаМаршрута В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(БизнесПроцесс.СогласованиеПорученийНаВыводАктивов.ТочкаМаршрута.СозданиеПроведениеАкцепта))";
					
	Запрос.УстановитьПараметр("Организация", ?(Организация = Неопределено, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Поручение, "Организация"), Организация));
	Запрос.УстановитьПараметр("Основание", Поручение);
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура НачатьБизнесПроцессПоДвижениюПаевПаевогоИнвестиционногоФонда(ИмяБизнесПроцесса, ДокументОбъект, Отказ) Экспорт
		
	Если Не РаботаСДокументами.ОрганизацияРаботаетСРозницейПИФ(ДокументОбъект.Организация, ДокументОбъект.Дата) Тогда
		Возврат;
	КонецЕсли;
	
	// #Техдолг. Дописать исключения		
	
	Запрос = Новый Запрос(		
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадачаПоБизнесПроцессу.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаПоБизнесПроцессу
		|ГДЕ
		|	ЗадачаПоБизнесПроцессу.Основание = &Ссылка
		|	И ТИПЗНАЧЕНИЯ(ЗадачаПоБизнесПроцессу.БизнесПроцесс) = &ТипПроцесса
		|	И НЕ ЗадачаПоБизнесПроцессу.ПометкаУдаления
		|	И &УсловиеДляЗачисленияПаев");
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТипПроцесса", "ТИП(БизнесПроцесс." + ИмяБизнесПроцесса + ")");
	
	// У процесса ЗачислениеПаев основание ВводДенежныхСредств, заявка - в отдельном поле
	Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"&УсловиеДляЗачисленияПаев",
			?(ИмяБизнесПроцесса = "ЗачислениеПаев", "ЗадачаПоБизнесПроцессу.БизнесПроцесс.ЗаявкаПайщика = &ЗаявкаПайщика", "ИСТИНА"));
	
	Если ИмяБизнесПроцесса = "ЗачислениеПаев" Тогда
		Запрос.УстановитьПараметр("ЗаявкаПайщика",	ДокументОбъект.Основание);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
				                                    
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);

	НовыйПроцесс = БизнесПроцессы[ИмяБизнесПроцесса].СоздатьБизнесПроцесс();
	НовыйПроцесс.Заполнить(ДокументОбъект.Ссылка);
	НовыйПроцесс.Записать();
		
	НовыйПроцесс.Старт();
	
	УстановитьПривилегированныйРежим(Ложь);
    
КонецПроцедуры

Процедура НайтиИВыполнитьЗадачуСистемногоПользователяПоБизнесПроцессу(Организация, Основание, ИмяПроцесса, ТочкаМаршрута, Отказ) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадачаИсполнителя.Ссылка КАК Задача
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(ЗадачаИсполнителя.БизнесПроцесс) = &ТипПроцесса
		|	И ЗадачаИсполнителя.ГруппаИсполнителей = &СистемныеПользователи
		|	И НЕ ЗадачаИсполнителя.Выполнена
		|	И НЕ ЗадачаИсполнителя.ПометкаУдаления
		|	И ЗадачаИсполнителя.ТочкаМаршрута = &ТочкаМаршрута
		|	И ЗадачаИсполнителя.Организация = &Организация
		|	И ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ЗадачаИсполнителя.БизнесПроцесс) = ТИП(БизнесПроцесс.ЗачислениеПаев)
		|				ТОГДА ЗадачаИсполнителя.БизнесПроцесс.ЗаявкаПайщика
		|			ИНАЧЕ ЗадачаИсполнителя.БизнесПроцесс.Основание
		|		КОНЕЦ = &Заявка");
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТипПроцесса", "ТИП(БизнесПроцесс." + ИмяПроцесса + ")");
	
	Запрос.УстановитьПараметр("СистемныеПользователи",
		Справочники.ГруппыПользователей.ПолучитьГруппуИсполнителей(
				ОбщегоНазначения.ПолучитьИменованныйОбъект("СистемныеПользователи"),
				Организация));
	
	Запрос.УстановитьПараметр("Организация",				Организация);
	Запрос.УстановитьПараметр("Заявка",						Основание);	
    Запрос.УстановитьПараметр("ТочкаМаршрута",				ТочкаМаршрута);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	КоличествоВВыборке = Выборка.Количество();
	Если КоличествоВВыборке >= 2 Тогда
		//##Зарегистрировать оповещение или ошибку?
		Отказ = Истина;
	ИначеЕсли КоличествоВВыборке = 0 Тогда
		// Уже выполнена
	Иначе
		
		Выборка.Следующий();
		
		Задача = Выборка.Задача.ПолучитьОбъект();
				
		Попытка
			Задача.ВыполнитьЗадачу();
		Исключение
			//##Зарегистрировать оповещение или ошибку?
			Отказ = Истина;
		КонецПопытки;			
		
	КонецЕсли;
	
КонецПроцедуры  

Процедура ВыполнитьОбменСДКРегион(ВидДействия, Отказ, Организация, Дата, ПаевойИнвестиционныйФонд = Неопределено, Задача = Неопределено) Экспорт
	
	ОбменДаннымиСДК = Обработки.ОбменДаннымиПИФ_С_ДК_Регион.Создать();
	
	ОбменДаннымиСДК.Дата						= Дата;
	ОбменДаннымиСДК.Организация					= Организация;                                                   
	
	Если ПаевойИнвестиционныйФонд <> Неопределено Тогда 
		ОбменДаннымиСДК.ПаевойИнвестиционныйФонд = ПаевойИнвестиционныйФонд;
	КонецЕсли;	
	
	Если Задача <> Неопределено Тогда
		ОбменДаннымиСДК.Задача = Задача;
	КонецЕсли;
	
	Если ВидДействия = "Выгрузка" Тогда	
		ОбменДаннымиСДК.ВыгрузитьДанные(Отказ);
	ИначеЕсли ВидДействия = "Загрузка" Тогда
		ОбменДаннымиСДК.ЗагрузитьДанные(Отказ);
	ИначеЕсли ВидДействия = "СверкаЗаявокЗаДень" Тогда
		ОбменДаннымиСДК.ВыгрузитьСверкуЗаявокЗаДень(Отказ);
	Иначе
		ВызватьИсключение "Неизвестный вид действия при вызове обработки обмена данными с ДК Регион";
	КонецЕсли;
		
КонецПроцедуры
